Tekla Open API Reference for Tekla Structures 2025
GridLine.GridLineAttributes.Font Property
 The grid line's font attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public FontAttributes Font { get; set; }
Public Property Font As FontAttributes
	Get
	Set
Property Value
Type: FontAttributes
See Also
Reference
GridLine.GridLineAttributes Class
Tekla.Structures.Drawing Namespace